<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Flash Player installer, extracts the embedded package, imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.FlashDebuggerExtractPackage</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeFlashDebugger</string>
        <key>MUNKI_REPO</key>
        <string>/Users/vmule/autopkg/munki</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>unstable</string>
            </array>
            <key>description</key>
            <string>Adobe® Flash® Player is a cross-platform browser-based application runtime that delivers uncompromised viewing of expressive applications, content, and videos across screens and browsers.</string>
            <key>display_name</key>
            <string>Adobe Flash Player</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>AdobeFlashDebbugger.download.recipe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Flash Plugin</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/Install Adobe Flash Player Debugger.app/Contents/Resources/Adobe Flash Player Debugger.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Payload</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/Payload/AdobeFlashPlayerComponent.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked_Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/unpacked_Payload/Library</string>
                <key>target</key>
                <string>%pkgroot%/Library</string>
            </dict>
            <key>Processor</key>
            <string>FileMover</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%pkgroot%</string>
                <key>finalize_script_path</key>
                <string>%RECIPE_CACHE_DIR%/Payload/AdobeFlashPlayerComponent.pkg/Scripts</string>
            </dict>
            <key>Processor</key>
            <string>AdobeFlashDmgUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiCatalogBuilder</string>
        </dict>
    </array>
</dict>
</plist>
