<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MacVim application.</string>
    <key>Identifier</key>
    <string>com.github.vmule.download.macvim</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacVim</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/b4winckler/macvim/releases/latest</string>
                <key>re_pattern</key>
                <string>(snapshot-.*/MacVim-snapshot-.*\.tbz)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/b4winckler/macvim/releases/download/%match%</string>
                <key>filename</key>
                <string>%NAME%.tbz</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
