<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Boot2Docker installer and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.vmule.munki.boot2docker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Boot2Docker</string>
        <key>MUNKI_REPO_SUBDIR</key>
	<string>apps/Boot2Docker</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
	    <array>
	   	<string>VirtualBox</string>
	   	<string>boot2docker</string>
	   	<string>docker</string>
    	    </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
	    <string>Developer</string>
	    <key>developer</key>
	    <string>boot2docker</string>
            <key>description</key>
            <string>Boot2Docker is a lightweight Linux distribution made specifically to run Docker containers.</string>
            <key>display_name</key>
            <string>Boot2Docker</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.vmule.download.boot2docker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>		
		<key>repo_subdirectory</key>
		<string>%MUNKI_REPO_SUBDIR%</string>
	    </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
